app/views/comments/_comment.html.erb


<% @post.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 7