app/controllers/posts_controller.rb

def create
  @post = current_member.posts.new(post_params)

  if @post.save
---
INSERT INTO `posts` (`created_at`, `member_id`, `text`, `title`, `updated_at`) VALUES ('2013-10-10 17:47:43', 3, 'hello it is my blog', 'its my blog', '2013-10-10 17:47:43')

def show
  @post = current_member.posts.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`member_id` = 3 AND `posts`.`id` = 9 LIMIT 1

 def index
  @posts = current_member.posts.all
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`member_id` = 1

def edit
  @post = current_member.posts.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`member_id` = 3 AND `posts`.`id` = 9 LIMIT 1

def update
  @post = current_member.posts.find(params[:id])

  if @post.update(post_params)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
UPDATE `posts` SET `title` = 'It a ', `updated_at` = '2013-10-07 18:45:13' WHERE `posts`.`id` = 3

def destroy
  @post = current_member.posts.find(params[:id])
  @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1